tutorials/viscoelasticFluidFoam/XPP_DE/0/Lambdasixth
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1-dev                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/jovani/jovaniFoam/foamNewSolver/cases/recentCases/upwind";
    case "XPP_DE";
    instance "0";
    local "";

    class volScalarField;
    object Lambdasixth;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField    uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    fixedWalls
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    simetry
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
 
